What does it mean to 'clean data'?  
    Rename columns.

    Rename the index.
    
    Remove irrelevant columns.
    
    Split one column into two.
    
    Combine two or more columns into one.
    
    Remove nondata rows.
    
    Remove repeated rows.
    
    Remove rows with missing data (aka NaN).
    
    Replace NaN data with a single value.
    
    Replace NaN data via interpolation.
    
    Standardize strings.
    
    Fix typos in strings.
    
    Remove whitespace from strings.
    
    Correct the types used for columns.
    
    Identify and remove outliers.

# what do I need to know 
`df.shape`

# Exercise 24: Parking cleanup

In [7]:
import pandas as pd
from pandas import DataFrame

Create a data frame from the file nyc-parking-violations-2020.csv. We are only interested in a handful of the columns:

`Plate ID`

`Registration State`

`Vehicle Make`

`Vehicle Color`

`Violation Time`

`Street Name`

How many rows are in the data frame when it is read into memory?

In [8]:
filepath24 = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\nyc-parking-violations-2020.csv"

ex24 = pd.read_csv(filepath24, usecols=['Plate ID', 'Registration State', 'Vehicle Make', 'Vehicle Color', 'Violation Time', 'Street Name'])

In [9]:
ex24

,Plate ID,Registration State,Vehicle Make,Violation Time,Street Name,Vehicle Color
0,J58JKX,NJ,HONDA,0523P,43 ST,BK
1,KRE6058,PA,ME/BE,0428P,UNION ST,BLK
2,444326R,NJ,LEXUS,0625A,CLERMONT AVENUE,BLACK
3,F728330,OH,CHEVR,1106A,DIVISION AVE,NaN
4,FMY9090,NY,JEEP,1253A,GRAND ST,GREY
...,...,...,...,...,...,...
12495729,62161MM,NY,FORD,1111A,3RD AVE,BR
12495730,GYE7330,NY,HONDA,0444P,PELHAM PARK DR,BLK
12495731,HNY4802,NY,FORD,0210A,LYDIG AVE,GY
12495732,T687081C,NY,TOYOT,0225P,E 68 STREET,BLK
12495733,3497ZN,WA,UTILI,0456A,W/S/O 182 STREET,WHITE

In [10]:
# learn somthing new: this function allows to see the total rows in the dataset 
len(ex24.index)

12495734

In [11]:
# there are 12,495,73 rows and 6 columns in this dataframe

In [12]:
ex24.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12495734 entries, 0 to 12495733
Data columns (total 6 columns):
 #   Column              Dtype
---  ------              -----
 0   Plate ID            object
 1   Registration State  object
 2   Vehicle Make        object
 3   Violation Time      object
 4   Street Name         object
 5   Vehicle Color       object
dtypes: object(6)
memory usage: 572.0+ MB

In [13]:
ex24.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12495734 entries, 0 to 12495733
Data columns (total 6 columns):
 #   Column              Non-Null Count     Dtype
---  ------              --------------     -----
 0   Plate ID            12495532 non-null  object
 1   Registration State  12495734 non-null  object
 2   Vehicle Make        12433314 non-null  object
 3   Violation Time      12495456 non-null  object
 4   Street Name         12494317 non-null  object
 5   Vehicle Color       12103752 non-null  object
dtypes: object(6)
memory usage: 572.0+ MB

In [14]:
ex24.isnull().sum()

Plate ID                 202
Registration State         0
Vehicle Make           62420
Violation Time           278
Street Name             1417
Vehicle Color         391982
dtype: int64

In [15]:
# `is.null().sum()` return the number of missing values (or NaN) of each column

Remove rows with any missing data (i.e., a NaN value). How many rows remain after doing this pruning? If each parking ticket brings $100 into the city, and missing data means the ticket can be successfully contested, how much money may New York City lose due to such missing data?

In [16]:
ex24_drop_nan = ex24.dropna()

In [17]:
ex24_drop_nan.isnull().sum()

Plate ID              0
Registration State    0
Vehicle Make          0
Violation Time        0
Street Name           0
Vehicle Color         0
dtype: int64

In [18]:
ex24_drop_nan.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12048375 entries, 0 to 12495733
Data columns (total 6 columns):
 #   Column              Dtype
---  ------              -----
 0   Plate ID            object
 1   Registration State  object
 2   Vehicle Make        object
 3   Violation Time      object
 4   Street Name         object
 5   Vehicle Color       object
dtypes: object(6)
memory usage: 643.5+ MB

In [19]:
# After removing all of the NaN, the data only has 12,495,733 row left

Letâ€™s instead assume that a ticket can only be dismissed if the license plate, state, car make, and/or street name are missing. Remove rows that are missing one or more of these. How many rows remain? Assuming $100/ticket, how much money would the city lose as a result of this missing data?

In [20]:
fine = 100

In [21]:
ex24_drop_nan_data = ex24_drop_nan.shape[0]
ex24_drop_nan_data

12048375

In [22]:
ex24_data = ex24.shape[0]
ex24_data

12495734

In [23]:
missing_fine = fine * (ex24_data - ex24_drop_nan_data)

In [24]:
(ex24_data - ex24_drop_nan_data) / ex24_data

0.03580093814416984

In [25]:
print (f"{missing_fine:,.2f}")

44,735,900.00

In [26]:
# the city will lose $44.7 million due to information that being missed in their record as there were about  447,359 record being missed

In [27]:
# learn something new: using len(df.index) is definately faster than my previous approach  
(len(ex24.index) - len(ex24_drop_nan.index)) * fine

44735900

In [28]:
f"${(len(ex24.index) - len(ex24_drop_nan.index)) * fine:,}"

'$44,735,900'

Now letâ€™s assume that tickets can be dismissed if the license plate, state, and/or street name are missingâ€”that is, the same as the previous question, but without requiring the make of car. Remove rows that are missing one or more of these. How many rows remain? Assuming $100/ticket, how much money would the city lose as a result of this missing data?

In [29]:
ex24_3 = ex24.dropna(subset=['Plate ID', 'Registration State', 'Street Name'])

In [30]:
ex24_3

,Plate ID,Registration State,Vehicle Make,Violation Time,Street Name,Vehicle Color
0,J58JKX,NJ,HONDA,0523P,43 ST,BK
1,KRE6058,PA,ME/BE,0428P,UNION ST,BLK
2,444326R,NJ,LEXUS,0625A,CLERMONT AVENUE,BLACK
3,F728330,OH,CHEVR,1106A,DIVISION AVE,NaN
4,FMY9090,NY,JEEP,1253A,GRAND ST,GREY
...,...,...,...,...,...,...
12495729,62161MM,NY,FORD,1111A,3RD AVE,BR
12495730,GYE7330,NY,HONDA,0444P,PELHAM PARK DR,BLK
12495731,HNY4802,NY,FORD,0210A,LYDIG AVE,GY
12495732,T687081C,NY,TOYOT,0225P,E 68 STREET,BLK
12495733,3497ZN,WA,UTILI,0456A,W/S/O 182 STREET,WHITE

In [31]:
ex24_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12494116 entries, 0 to 12495733
Data columns (total 6 columns):
 #   Column              Dtype
---  ------              -----
 0   Plate ID            object
 1   Registration State  object
 2   Vehicle Make        object
 3   Violation Time      object
 4   Street Name         object
 5   Vehicle Color       object
dtypes: object(6)
memory usage: 667.3+ MB

In [32]:
ex24_3.isnull().sum()

Plate ID                   0
Registration State         0
Vehicle Make           62167
Violation Time           263
Street Name                0
Vehicle Color         391664
dtype: int64

In [33]:
ex24_3_data = ex24_3.shape[0]

In [34]:
ex24_3_data

12494116

In [35]:
missing_fine = fine * (ex24_data - ex24_3_data)

print (f"{missing_fine:,.2f}")

161,800.00

In [36]:
# beyond the exercise

In [37]:
# Null data is bad, but there is plenty of bad non-null data, too. For example, many cars with BLANKPLATE as a plate ID were ticketed. Turn these into NaN values, and rerun the previous query.

In [38]:
s = '00:11:22'
print (s[3:5])

11

In [39]:
s

'00:11:22'

# Exercise 26: Celebrity dealths

Create a data frame from the file celebrity_deaths_2016.csv. For this exercise, weâ€™ll use only two columns:
`dateofdeath`
`age`

In [40]:
filepath26 = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\celebrity_deaths_2016.csv"

ex26 = pd.read_csv(filepath26, usecols=['dateofdeath','age'])
ex26

     dateofdeath age
0     2016-01-01  71
1     2016-01-01  74
2     2016-01-01  79
3     2016-01-01  45
4     2016-01-01  83
...          ...  ..
6538  2016-12-27  74
6539  2016-12-27  85
6540  2016-12-27  83
6541  2016-12-27  23
6542  2016-12-27  84

[6543 rows x 2 columns]

In [41]:
ex26.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6543 entries, 0 to 6542
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6543 non-null   object
 1   age          6516 non-null   object
dtypes: object(2)
memory usage: 102.4+ KB

Create a new month column containing the month from the dateofdeath column.

In [42]:
import numpy as np

In [43]:
# this will fail if any of the rows in df['colname'] cannot be turned into integers. Thatâ€™s because the strings either are empty or contain nondigit characters.

In [44]:
ex26[ex26['dateofdeath'].str.isdigit()]

Empty DataFrame
Columns: [dateofdeath, age]
Index: []

In [45]:
ex26['monthofdeath'] = ex26['dateofdeath'].str.slice(5,7)

In [46]:
ex26

     dateofdeath age monthofdeath
0     2016-01-01  71           01
1     2016-01-01  74           01
2     2016-01-01  79           01
3     2016-01-01  45           01
4     2016-01-01  83           01
...          ...  ..          ...
6538  2016-12-27  74           12
6539  2016-12-27  85           12
6540  2016-12-27  83           12
6541  2016-12-27  23           12
6542  2016-12-27  84           12

[6543 rows x 3 columns]

Make the month column the index of the data frame.

In [47]:
ex26_index  = ex26.set_index('monthofdeath')

In [48]:
ex26_index

             dateofdeath age
monthofdeath
01            2016-01-01  71
01            2016-01-01  74
01            2016-01-01  79
01            2016-01-01  45
01            2016-01-01  83
...                  ...  ..
12            2016-12-27  74
12            2016-12-27  85
12            2016-12-27  83
12            2016-12-27  23
12            2016-12-27  84

[6543 rows x 2 columns]

Sort the data frame by the index.

In [49]:
ex26_index.sort_index()

             dateofdeath age
monthofdeath
01            2016-01-01  71
01            2016-01-21  47
01            2016-01-21  87
01            2016-01-21  90
01            2016-01-21  73
...                  ...  ..
12            2016-12-10  63
12            2016-12-10  20
12            2016-12-10  57
12            2016-12-10  78
12            2016-12-27  84

[6543 rows x 2 columns]

Clean all nonintegers from the age column.

In [50]:
ex26_index.isnull().sum() / len(ex26_index['age'])

dateofdeath    0.000000
age            0.004127
dtype: float64

In [51]:
ex26_index[ex26_index['age'].isnull()]

             dateofdeath  age
monthofdeath
01            2016-01-23  NaN
01            2016-01-25  NaN
01            2016-01-30  NaN
02            2016-02-09  NaN
02            2016-02-15  NaN
03            2016-03-05  NaN
03            2016-03-25  NaN
04            2016-04-02  NaN
04            2016-04-05  NaN
04            2016-04-11  NaN
04            2016-04-22  NaN
05            2016-05-10  NaN
05            2016-05-17  NaN
05            2016-05-22  NaN
06            2016-06-17  NaN
06            2016-06-22  NaN
07            2016-07-08  NaN
07            2016-07-10  NaN
08            2016-08-26  NaN
09            2016-09-26  NaN
10            2016-10-05  NaN
10            2016-10-06  NaN
10            2016-10-18  NaN
11            2016-11-11  NaN
11            2016-11-28  NaN
12            2016-12-19  NaN
12            2016-12-22  NaN

In [52]:
ex26_index = ex26_index.dropna(subset='age')

In [53]:
ex26_index.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6516 entries, 01 to 12
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6516 non-null   object
 1   age          6516 non-null   object
dtypes: object(2)
memory usage: 152.7+ KB

In [54]:
ex26_index

             dateofdeath age
monthofdeath
01            2016-01-01  71
01            2016-01-01  74
01            2016-01-01  79
01            2016-01-01  45
01            2016-01-01  83
...                  ...  ..
12            2016-12-27  74
12            2016-12-27  85
12            2016-12-27  83
12            2016-12-27  23
12            2016-12-27  84

[6516 rows x 2 columns]

In [55]:
# this is the initial approach that I think of, which is to find all the NON digital values

In [56]:
age_nondigit = ex26_index[~ex26_index['age'].str.isdigit()]

In [57]:
age_nondigit

             dateofdeath        age
monthofdeath
01            2016-01-07       8889
02            2016-02-08       4445
02            2016-02-15       5253
02            2016-02-20       6869
02            2016-02-29       3031
03            2016-03-12       6768
03            2016-03-19       6364
03            2016-03-25       5759
03            2016-03-29       9293
04            2016-04-02       3435
04            2016-04-08       7677
04            2016-04-11       2526
04            2016-04-12      68-69
04            2016-04-18       7980
05            2016-05-01       9192
05            2016-05-06       2930
05            2016-05-11       8081
05            2016-05-11       9394
05            2016-05-14       7374
05            2016-05-21      c. 48
07            2016-07-13      51-52
07            2016-07-22     c._180
07            2016-07-24       4243
08            2016-08-09      61/62
08            2016-08-19       6667
08            2016-08-20      77/78
08            2016-08-30      38/39
09            2016-09-07       8485
09            2016-09-12       6970
10            2016-10-20        50s
10            2016-10-21      59-60
10            2016-10-29   56 or 57
11            2016-11-11       7778
11            2016-11-11       8182
12            2016-12-16      c. 48

In [58]:
# the text book provide different approach

In [59]:
ex26_index['age' ] = pd.to_numeric(ex26_index['age'])

ValueError: Unable to parse string " 68-69" at position 2070

In [60]:
ex26_index['age' ] = pd.to_numeric(ex26_index['age'], errors='coerce')

C:\Users\dqthi\AppData\Local\Temp\ipykernel_58508\689630326.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex26_index['age' ] = pd.to_numeric(ex26_index['age'], errors='coerce')

In [61]:
ex26_index['age'].describe()

count    6505.000000
mean      100.960338
std       413.994127
min         7.000000
25%        69.000000
50%        81.000000
75%        89.000000
max      9394.000000
Name: age, dtype: float64

In [62]:
ex26_index = ex26_index.loc[ex26_index['age'] < 120]

In [63]:
ex26_index['age'].describe()

count    6481.000000
mean       77.019287
std        16.428815
min         7.000000
25%        69.000000
50%        81.000000
75%        89.000000
max       116.000000
Name: age, dtype: float64

Find the average age of celebrities who died during that period.

In [64]:
ex26_index

             dateofdeath   age
monthofdeath
01            2016-01-01  71.0
01            2016-01-01  74.0
01            2016-01-01  79.0
01            2016-01-01  45.0
01            2016-01-01  83.0
...                  ...   ...
12            2016-12-27  74.0
12            2016-12-27  85.0
12            2016-12-27  83.0
12            2016-12-27  23.0
12            2016-12-27  84.0

[6481 rows x 2 columns]

In [65]:
ex26_index['age'].mean()

77.0192871470452

In [66]:
# beyond the exercise:  
# Add a new column, day, from the day of the month in which the celebrity died. Then create a multi-index (from month and day). What was the average age of death from Feb. 15 through July 15?

In [67]:
ex26_index

             dateofdeath   age
monthofdeath
01            2016-01-01  71.0
01            2016-01-01  74.0
01            2016-01-01  79.0
01            2016-01-01  45.0
01            2016-01-01  83.0
...                  ...   ...
12            2016-12-27  74.0
12            2016-12-27  85.0
12            2016-12-27  83.0
12            2016-12-27  23.0
12            2016-12-27  84.0

[6481 rows x 2 columns]

Turn the age column into an integer value.

In [68]:
len(ex26.loc[0, 'dateofdeath'])

10

In [69]:
ex26_index['date'] = ex26_index['dateofdeath'].str.slice(8,10)

C:\Users\dqthi\AppData\Local\Temp\ipykernel_58508\2769432065.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex26_index['date'] = ex26_index['dateofdeath'].str.slice(8,10)

In [70]:
ex26_index

             dateofdeath   age date
monthofdeath
01            2016-01-01  71.0   01
01            2016-01-01  74.0   01
01            2016-01-01  79.0   01
01            2016-01-01  45.0   01
01            2016-01-01  83.0   01
...                  ...   ...  ...
12            2016-12-27  74.0   27
12            2016-12-27  85.0   27
12            2016-12-27  83.0   27
12            2016-12-27  23.0   27
12            2016-12-27  84.0   27

[6481 rows x 3 columns]

In [71]:
ex26_multiple_index = ex26_index.reset_index()

In [72]:
ex26_multiple_index

     monthofdeath dateofdeath   age date
0              01  2016-01-01  71.0   01
1              01  2016-01-01  74.0   01
2              01  2016-01-01  79.0   01
3              01  2016-01-01  45.0   01
4              01  2016-01-01  83.0   01
...           ...         ...   ...  ...
6476           12  2016-12-27  74.0   27
6477           12  2016-12-27  85.0   27
6478           12  2016-12-27  83.0   27
6479           12  2016-12-27  23.0   27
6480           12  2016-12-27  84.0   27

[6481 rows x 4 columns]

In [73]:
ex26_multiple_index['date'].dtype

dtype('O')

In [74]:
ex26_multiple_index['monthofdeath'].dtype

dtype('O')

In [75]:
ex26_multiple_index['date'] = ex26_multiple_index['date'].astype('int32')

In [76]:
ex26_multiple_index['date'].dtype

dtype('int32')

In [77]:
ex26_multiple_index['monthofdeath'] = ex26_multiple_index['monthofdeath'].astype('int32')

In [78]:
ex26_multiple_index['monthofdeath'].dtype

dtype('int32')

In [79]:
ex26_multiple_index.set_index(['monthofdeath', 'date'])

                  dateofdeath   age
monthofdeath date
1            1     2016-01-01  71.0
             1     2016-01-01  74.0
             1     2016-01-01  79.0
             1     2016-01-01  45.0
             1     2016-01-01  83.0
...                       ...   ...
12           27    2016-12-27  74.0
             27    2016-12-27  85.0
             27    2016-12-27  83.0
             27    2016-12-27  23.0
             27    2016-12-27  84.0

[6481 rows x 2 columns]

In [80]:
ex26_multiple_index.loc[(2, 1), 'age']

AssertionError:

In [ ]:
ex26_multiple_index.loc[("1", "1")]

KeyError: '1'

In [81]:
ex26_multiple_index = ex26_multiple_index.set_index(['monthofdeath', 'date'])

In [82]:
ex26_multiple_index

                  dateofdeath   age
monthofdeath date
1            1     2016-01-01  71.0
             1     2016-01-01  74.0
             1     2016-01-01  79.0
             1     2016-01-01  45.0
             1     2016-01-01  83.0
...                       ...   ...
12           27    2016-12-27  74.0
             27    2016-12-27  85.0
             27    2016-12-27  83.0
             27    2016-12-27  23.0
             27    2016-12-27  84.0

[6481 rows x 2 columns]

In [83]:
# seclecting ranges or slices with pd.IndexSlice

In [84]:
# selecting multiple rows by multiindex with Lists

In [85]:
ex26_multiple_index = ex26_multiple_index.reset_index()

In [86]:
ex26_btx_1 = ex26_multiple_index

In [87]:
# add up using this basic code line to solve the question above

In [88]:
ex26_btx_1[((ex26_btx_1['monthofdeath'] >= 2) & (ex26_btx_1['monthofdeath'] <=7 )) & ((ex26_btx_1['monthofdeath'] >= 2) & (ex26_btx_1['date'] <=15))]['age'].mean()

76.74033816425121

In [89]:
ex26_btx_2 = pd.read_csv(filepath26, usecols=['dateofdeath','age','causeofdeath'])

In [90]:
ex26_btx_2

     dateofdeath age                causeofdeath
0     2016-01-01  71                brain cancer
1     2016-01-01  74                      cancer
2     2016-01-01  79                      cancer
3     2016-01-01  45   complications of a stroke
4     2016-01-01  83               heart failure
...          ...  ..                         ...
6538  2016-12-27  74                         NaN
6539  2016-12-27  85                         NaN
6540  2016-12-27  83                         NaN
6541  2016-12-27  23                  euthanized
6542  2016-12-27  84                         NaN

[6543 rows x 3 columns]

In [91]:
ex26_btx_2.describe()

       dateofdeath   age causeofdeath
count         6543  6516         1535
unique         364   138          361
top     2016-11-28    86       cancer
freq            43   236          248

In [92]:
ex26_btx_2['causeofdeath'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 6543 entries, 0 to 6542
Series name: causeofdeath
Non-Null Count  Dtype
--------------  -----
1535 non-null   object
dtypes: object(1)
memory usage: 51.2+ KB

In [93]:
ex26_btx_2.isnull().sum()

dateofdeath        0
age               27
causeofdeath    5008
dtype: int64

In [94]:
ex26_btx_2['causeofdeath'].value_counts()

causeofdeath
 cancer                                                248
 heart attack                                          125
 traffic collision                                      56
 lung cancer                                            51
 pneumonia                                              50
                                                      ...
 complications from accident                             1
 septic shock                                            1
 grenade explosion                                       1
 complications from esophageal cancer and pneumonia      1
euthanized                                               1
Name: count, Length: 361, dtype: int64

In [95]:
ex26_btx_2[ex26_btx_2['causeofdeath'].isnull()] = 'unknow'

In [96]:
ex26_btx_2.isnull().sum()

dateofdeath     0
age             4
causeofdeath    0
dtype: int64

Recap: 
- still having confusion running MultipleINdex 
- getting to know a better way to capture data that i want to analyze through the mistake that I made 
    - end up using a much simplier approach to solve the question without using multiple indexs 
- start from chapter 6, i better do each notebook for each exercise instead of combine all the exercises into one notebook as it might cause kennell class

# Exercise 27: Titanic Interpolation

Load the titanic3.xls data into a data frame. Note that this file is an Excel spreadsheet, so you wonâ€™t be able to use read_csv. Rather, youâ€™ll have to use read_excel.

In [1]:
import pandas as pd 
from pandas import DataFrame

In [2]:
filepath27 = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\titanic3.xls"

ex27 = pd.read_excel(filepath27)

In [3]:
ex27

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

Determine which columns contain null values.

In [4]:
ex27.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [5]:
# to get the column names that meet the following condition 
ex27.columns[ex27.isnull().sum() > 0]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [6]:
# columns that have information missing are: 
#  `age` 263 data, `cabin` 1014 data, `embarked` 2 data, `boat` 823 data, `body` 1188 data, `home.dest` 564 data

In [7]:
ex27.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

For each column containing null values, decide whether you will fill it with a valueâ€”and if so, with what value, calculated or otherwise.

In [8]:
# remove as the mising value on present 1 or 2 samples of the data 
    # `fare`
    # `boat`            

# update the nan value to mean of the data 
    # `age`             

# update the nan value to mode of the data

# `embarked`        remove

# `body`            remove
# `home.dest`       remove

In [9]:
ex27 = ex27.dropna(subset=['fare','boat'])

In [10]:
ex27['age'] = ex27['age'].fillna(ex27['age'].mean())

C:\Users\dqthi\AppData\Local\Temp\ipykernel_28156\811603696.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex27['age'] = ex27['age'].fillna(ex27['age'].mean())

In [11]:
ex27['home.dest'] = ex27['home.dest'].fillna(ex27['home.dest'].mode())

C:\Users\dqthi\AppData\Local\Temp\ipykernel_28156\1820308666.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex27['home.dest'] = ex27['home.dest'].fillna(ex27['home.dest'].mode())

In [12]:
ex27.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
cabin        293
embarked       2
boat           0
body         486
home.dest    145
dtype: int64

In [24]:
home_dest_mode = ex27['home.dest'].mode()

In [25]:
home_dest_mode

0    New York, NY
Name: home.dest, dtype: object

In [27]:
ex27[ex27['home.dest'].isnull()]['home.dest'] = home_dest_mode

C:\Users\dqthi\AppData\Local\Temp\ipykernel_28156\2157626807.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex27[ex27['home.dest'].isnull()]['home.dest'] = home_dest_mode

In [49]:
ex27['home.dest'] = ex27['home.dest'].fillna(home_dest_mode)

C:\Users\dqthi\AppData\Local\Temp\ipykernel_28156\761257279.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex27['home.dest'] = ex27['home.dest'].fillna(home_dest_mode)

In [63]:
type(ex27['home.dest'])

pandas.core.series.Series

In [62]:
ex27.loc[:,['home.dest']].fillna(home_dest_mode)

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
5                        New York, NY
6                          Hudson, NY
8                 Bayside, Queens, NY
...                               ...
1260                              NaN
1261                              NaN
1277                              NaN
1286                              NaN
1299                              NaN

[486 rows x 1 columns]

In [32]:
ex27

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1260,3,1,"Turja, Miss. Anna Sofia",female,18.0000,0,0,4138,9.8417,NaN,S,15,NaN,NaN
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0000,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1277,3,1,"Vartanian, Mr. David",male,22.0000,0,0,2658,7.2250,NaN,C,13 15,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0000,1,0,2659,14.4542,NaN,C,C,NaN,NaN

In [22]:
ex27[ex27['home.dest'].isnull()]['home.dest'] = ex27['home.dest'].mode()

C:\Users\dqthi\AppData\Local\Temp\ipykernel_28156\3027169117.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ex27[ex27['home.dest'].isnull()]['home.dest'] = ex27['home.dest'].mode()

In [23]:
ex27['home.dest'].isnull().sum()

145

In [14]:
ex27.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
cabin        293
embarked       2
boat           0
body         486
home.dest    145
dtype: int64

In [15]:
ex27

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1260,3,1,"Turja, Miss. Anna Sofia",female,18.0000,0,0,4138,9.8417,NaN,S,15,NaN,NaN
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0000,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1277,3,1,"Vartanian, Mr. David",male,22.0000,0,0,2658,7.2250,NaN,C,13 15,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0000,1,0,2659,14.4542,NaN,C,C,NaN,NaN

outstanding note: 2 things that are standing out from this exercise: 
- the error come out from slicechain when I want to fillnan value of column 'home.dest' to the mode value of this column. the system send a warmning message
      - SettingWithCopyWarning: 
      - A value is trying to be set on a copy of a slice from a DataFrame.
      - Try using .loc[row_indexer,col_indexer] = value instead

      - See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
      - ex27[ex27['home.dest'].isnull()]['home.dest'] = ex27['home.dest'].mode()

- I still havent figured out how to make this work yet. Need to read the document carefullly and make sure this work

# Exercise 28: Inconsistent Data

In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame

Create a data frame from the file nyc-parking-violations-2020.csv. We are only interested in a handful of the columns:

    `Plate ID
    Registration State
    Vehicle Make
    Vehicle Color
    Street Name`

In [4]:
filepath28 = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\nyc-parking-violations-2020.csv"

ex28 = pd.read_csv(filepath28,usecols=['Plate ID', 'Registration State', 'Vehicle Make', 'Vehicle Color', 'Street Name'])

In [5]:
ex28.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12495734 entries, 0 to 12495733
Data columns (total 5 columns):
 #   Column              Dtype
---  ------              -----
 0   Plate ID            object
 1   Registration State  object
 2   Vehicle Make        object
 3   Street Name         object
 4   Vehicle Color       object
dtypes: object(5)
memory usage: 476.7+ MB

Determine how many different vehicle colors (the Vehicle Color column) there are.

In [6]:
ex28['Vehicle Color'].value_counts()

Vehicle Color
WH       2344858
GY       2307704
BK       2066374
WHITE    1061234
BL        775124
          ...
RD-CH          1
ELK            1
WICK           1
MARIO          1
CH             1
Name: count, Length: 1896, dtype: int64

In [ ]:
# there are 1896 different colors in this column. as d

Look at the 30 most common colors, and identify colors that appear multiple times but are written differently. For example, the color WHITE is also written WT, WT., and WHT.

In [7]:
ex28['Vehicle Color'].value_counts().head(30)

Vehicle Color
WH       2344858
GY       2307704
BK       2066374
WHITE    1061234
BL        775124
RD        483298
BLACK     465110
GREY      306787
BROWN     292348
SILVE     191477
GR        182929
BLUE      178298
RED       161693
TN        120576
BR        102204
YW         98700
BLK        91539
OTHER      60245
GREEN      58765
GL         54851
GRY        46527
MR         42812
GRAY       40854
WHT        35433
YELLO      32792
WHI        29760
OR         28100
BK.        27830
WT         25583
WT.        24593
Name: count, dtype: int64

In [8]:
colormap = {'WH': 'WHITE', 'GY':'GRAY', 'BK':'BLACK',
           'BL':'BLUE', 'RD':'RED', 'SILVE':'SILVER',
           'GR':'GRAY', 'TN':'TAN', 'BR':'BROWN',
           'YW':'YELLO', 'BLK':'BLACK', 'GRY':'GRAY',
           'WHT':'WHITE', 'WHI':'WHITE', 'OR':'ORANGE',
           'BK.':'BLACK', 'WT':'WHITE', 'WT.':'WHITE'}

Prepare a Python dict in which the keys represent the various color-name inputs and the values represent the values you want them to have in the end. I suggest using longer names, such as WHITE, rather than shorter ones

In [9]:
ex28['Vehicle Color'] = ex28['Vehicle Color'].replace(colormap)

In [ ]:
len(ex28['Vehicle Color'].value_counts().index)

1880

In [11]:
colormap2 = {'WH': 'WHITE', 'GY':'GRAY',
             'BK':'BLACK', 'BL':'BLUE',
             'RD':'RED', 'GR':'GRAY',
             'TN':'TAN', 'BR':'BROWN',
             'YW':'YELLO', 'BLK':'BLACK',
             'GRY':'GRAY', 'WHT':'WHITE',
             'WHI':'WHITE', 'OR':'ORANG',
             'BK.':'BLACK', 'WT':'WHITE',
             'WT.':'WHITE'}

In [12]:
ex28['Vehicle Color'] = ex28['Vehicle Color'].replace(colormap2)

Replace the existing (old) colors with your translations. How many colors are there now?

In [13]:
len(ex28['Vehicle Color'].value_counts().index)

1880

In [14]:
ex28['Vehicle Color'].value_counts().head(30)

Vehicle Color
WHITE     3521461
BLACK     2650853
GRAY      2578014
BLUE       953422
RED        644991
BROWN      394552
GREY       306787
SILVER     191477
TAN        141667
YELLO      131492
OTHER       60245
GREEN       58765
GL          54851
MR          42812
ORANGE      28100
GY.         22460
GOLD        21687
SIL         20116
BLU         15240
SL.         13145
LTGY        13055
ORANG       11506
SL          10343
LTG         10093
BL.          9649
LT/          8976
PR           7518
DK/          7498
W            7367
RD.          7128
Name: count, dtype: int64

Look through the top 50 colors now that you have removed a bunch of them. Are there any you could still clean up? Are there any you cannot figure out? Can you identify some consistent typos and errors in the colors?

In [ ]:
ex28['Vehicle Color'].value_counts().head(50).sum()

12016408

In [ ]:
ex28['Vehicle Color'].value_counts().sum() - ex28['Vehicle Color'].value_counts().head(50).sum()

87344

In [18]:
(ex28['Vehicle Color'].value_counts().head(50).sum() / ex28['Vehicle Color'].value_counts().sum()) * 100

99.27837252448663

In [ ]:
# the top 50 colors already cover 99.27% of the data set. By removing 'characters' of the colors, I think I can improve the accuracy of this data pretty well.

# what do I learn from this chapter: 
- different technique to remove `NaN` or replace `NaN` with different values statistical analysis 
- i was introduced the actual work of data cleaning, which is to modify a column that being input values in different format and structure  
- learned about `replace(map)`d

# When I have more time, I would: 
- Test out my approach and steps for data cleaning. 
  - treat this column value is a string, then write a function to check for 'puntuation' of each string value to remove the puntuation  
  - check for tring with 1, 2, 3, 4, 5, 6 letters

interesting enough: reading from the document of .replace, i learn of the following. seems like this can be short cut to solve the characters and signs that are in the string. 

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html

In [ ]:
>>> df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})
        A    B
0   new  abc
1   xyz  new
2  bait  xyz

In [ ]:
>>> df.replace(regex=[r'^ba.$', 'foo'], value='new')
        A    B
0   new  abc
1   new  new
2  bait  xyz